[
    {
        "stage": "follow",
        "result": 55,
        "feedback": {
            "right_wrist_angle": {
                "condition": "big less",
                "feedback": [
                    "Severely over-snapped wrist disrupts shot consistency.",
                    "Moderate wrist snap for consistent follow-through."
                ]
            },
            "right_shoulder_angle": {
                "condition": "big less",
                "feedback": [
                    "Severely low shoulder weakens follow-through, reducing arc.",
                    "Elevate shoulder significantly for complete follow-through."
                ]
            },
            "right_knee_angle": {
                "condition": "big less",
                "feedback": [
                    "Severely incomplete knee extension causes unstable landing.",
                    "Fully extend knees for stable, balanced landing."
                ]
            },
            "left_elbow_angle": {
                "condition": "big less",
                "feedback": [
                    "Severely bent guide elbow disrupts follow-through balance.",
                    "Maintain slight bend in guide elbow for smooth follow-through."
                ]
            },
            "left_wrist_angle": {
                "condition": "big less",
                "feedback": [
                    "Severely flexed guide wrist disrupts follow-through balance.",
                    "Maintain neutral guide wrist for consistent follow-through."
                ]
            },
            "left_knee_angle": {
                "condition": "big less",
                "feedback": [
                    "Severely incomplete guide knee extension causes unstable landing.",
                    "Fully extend guide knee for balanced landing."
                ]
            }
        }
    },
    {
        "stage": "gather",
        "result": 50,
        "feedback": {
            "right_elbow_angle": {
                "condition": "big more",
                "feedback": [
                    "Severely flared elbow disrupts alignment, causing major accuracy loss.",
                    "Keep elbow tightly tucked to align with basket."
                ]
            },
            "right_wrist_angle": {
                "condition": "big less",
                "feedback": [
                    "Severely flexed wrist disrupts grip, causing fumbling.",
                    "Reduce wrist flexion significantly for stable grip."
                ]
            },
            "right_hip_angle": {
                "condition": "big more",
                "feedback": [
                    "Severely premature hip extension disrupts timing, causing imbalance.",
                    "Maintain significant hip bend for balanced transition."
                ]
            },
            "right_knee_angle": {
                "condition": "big less",
                "feedback": [
                    "Severely delayed knee extension slows transition, rushing shot.",
                    "Extend knees significantly for smoother transition."
                ]
            },
            "left_elbow_angle": {
                "condition": "big less",
                "feedback": [
                    "Severely bent guide elbow delays shot setup, rushing release.",
                    "Extend guide elbow significantly for alignment."
                ]
            },
            "left_wrist_angle": {
                "condition": "big less",
                "feedback": [
                    "Severely flexed guide wrist causes fumbling, disrupting shot.",
                    "Keep guide wrist neutral for stable grip."
                ]
            },
            "left_hip_angle": {
                "condition": "big more",
                "feedback": [
                    "Severely premature guide hip extension disrupts balance, affecting rhythm.",
                    "Maintain significant guide hip bend for symmetry."
                ]
            }
        }
    },
    {
        "stage": "loading",
        "result": 21,
        "feedback": {
            "right_wrist_angle": {
                "condition": "big more",
                "feedback": [
                    "Severely rigid wrist misaligns ball, disrupting setup.",
                    "Maintain neutral wrist position to align ball properly."
                ]
            },
            "right_hip_angle": {
                "condition": "big more",
                "feedback": [
                    "Severely straight hips create unstable base, drastically reducing power.",
                    "Bend hips significantly for a balanced, athletic stance."
                ]
            },
            "right_knee_angle": {
                "condition": "big more",
                "feedback": [
                    "Severely straight knees create unstable base, drastically reducing power.",
                    "Bend knees significantly for explosive jump and stability."
                ]
            },
            "left_elbow_angle": {
                "condition": "big more",
                "feedback": [
                    "Severely extended guide elbow pushes ball off-center, disrupting setup.",
                    "Bend guide elbow significantly to stabilize ball."
                ]
            },
            "left_hip_angle": {
                "condition": "big less",
                "feedback": [
                    "Severely excessive guide hip bend causes major imbalance.",
                    "Reduce guide hip bend significantly for better balance."
                ]
            }
        }
    },
    {
        "stage": "release",
        "result": 91,
        "feedback": {
            "right_elbow_angle": {
                "condition": "big less",
                "feedback": [
                    "Severely incomplete extension results in low release, drastically reducing power.",
                    "Fully extend elbow at release for maximum power and height."
                ]
            },
            "right_wrist_angle": {
                "condition": "big less",
                "feedback": [
                    "Severely excessive snap causes erratic release, reducing accuracy.",
                    "Moderate wrist snap significantly for controlled release."
                ]
            },
            "right_shoulder_angle": {
                "condition": "big less",
                "feedback": [
                    "Severely low shoulder drastically limits shot height and power.",
                    "Elevate shoulder significantly for added power and height."
                ]
            },
            "right_knee_angle": {
                "condition": "big less",
                "feedback": [
                    "Severely incomplete knee extension drastically limits shot elevation.",
                    "Fully extend knees for maximum shot power."
                ]
            },
            "left_knee_angle": {
                "condition": "big less",
                "feedback": [
                    "Severely incomplete guide knee extension reduces stability drastically.",
                    "Fully extend guide knee for maximum power and stability."
                ]
            }
        }
    }
]