[
    {
        "stage": "follow",
        "result": 98,
        "feedback": {
            "right_wrist_angle": {
                "condition": "big less",
                "feedback": [
                    "Severely over-snapped wrist disrupts shot consistency.",
                    "Moderate wrist snap for consistent follow-through."
                ]
            }
        }
    },
    {
        "stage": "gather",
        "result": 81,
        "feedback": {
            "right_elbow_angle": {
                "condition": "more",
                "feedback": [
                    "Flared elbow reduces shot accuracy due to misalignment.",
                    "Tuck elbow in for proper alignment with the basket."
                ]
            },
            "right_wrist_angle": {
                "condition": "big less",
                "feedback": [
                    "Severely flexed wrist disrupts grip, causing fumbling.",
                    "Reduce wrist flexion significantly for stable grip."
                ]
            },
            "right_hip_angle": {
                "condition": "big more",
                "feedback": [
                    "Severely premature hip extension disrupts timing, causing imbalance.",
                    "Maintain significant hip bend for balanced transition."
                ]
            },
            "right_knee_angle": {
                "condition": "big less",
                "feedback": [
                    "Severely delayed knee extension slows transition, rushing shot.",
                    "Extend knees significantly for smoother transition."
                ]
            },
            "left_knee_angle": {
                "condition": "big less",
                "feedback": [
                    "Severely delayed guide knee extension slows transition, rushing shot.",
                    "Extend guide knee significantly for smoother transition."
                ]
            }
        }
    },
    {
        "stage": "loading",
        "result": 80,
        "feedback": {
            "right_wrist_angle": {
                "condition": "big more",
                "feedback": [
                    "Severely rigid wrist misaligns ball, disrupting setup.",
                    "Maintain neutral wrist position to align ball properly."
                ]
            },
            "right_hip_angle": {
                "condition": "big more",
                "feedback": [
                    "Severely straight hips create unstable base, drastically reducing power.",
                    "Bend hips significantly for a balanced, athletic stance."
                ]
            },
            "right_knee_angle": {
                "condition": "big less",
                "feedback": [
                    "Severely excessive knee bend causes major instability, slowing shot.",
                    "Reduce knee bend significantly for better mobility and balance."
                ]
            },
            "left_knee_angle": {
                "condition": "big less",
                "feedback": [
                    "Severely excessive guide knee bend causes major imbalance.",
                    "Reduce guide knee bend significantly for better balance."
                ]
            }
        }
    },
    {
        "stage": "release",
        "result": 98,
        "feedback": {
            "right_elbow_angle": {
                "condition": "big more",
                "feedback": [
                    "Severely early extension leads to low release point, flattening trajectory.",
                    "Maintain significant elbow bend for higher release and better arc."
                ]
            },
            "right_wrist_angle": {
                "condition": "big less",
                "feedback": [
                    "Severely excessive snap causes erratic release, reducing accuracy.",
                    "Moderate wrist snap significantly for controlled release."
                ]
            },
            "right_knee_angle": {
                "condition": "big less",
                "feedback": [
                    "Severely incomplete knee extension drastically limits shot elevation.",
                    "Fully extend knees for maximum shot power."
                ]
            },
            "left_elbow_angle": {
                "condition": "big less",
                "feedback": [
                    "Severely bent guide elbow interferes with release, causing side spin.",
                    "Extend guide elbow slightly for clean release."
                ]
            },
            "left_knee_angle": {
                "condition": "big less",
                "feedback": [
                    "Severely incomplete guide knee extension reduces stability drastically.",
                    "Fully extend guide knee for maximum power and stability."
                ]
            }
        }
    }
]